Repository: sulieman-Albuaeshi/survey-application
Catalog: locale/*/LC_MESSAGES/django.po
Languages: ar

source: English
ar: الإنجليزية

source: Arabic
ar: العربية

source: e.g. Customer Satisfaction
ar: مثال: رضا العملاء

source: e.g. This survey is about customer satisfaction.
ar: مثال: هذا الاستبيان حول رضا العملاء.

source: Survey Name
ar: اسم الاستبيان

source: Title
ar: العنوان

source: Description
ar: الوصف

source: Shuffle Questions
ar: خلط الأسئلة

source: Anonymous Responses
ar: ردود مجهولة

source: Enter the label of the question
ar: أدخل عنوان السؤال

source: Enter the helper text of the question
ar: أدخل نص المساعدة للسؤال

source: Label
ar: العنوان

source: Helper Text
ar: نص المساعدة

source: Required
ar: مطلوب

source: Enter the minimum number of options to be selected
ar: أدخل الحد الأدنى من الخيارات التي يجب تحديدها

source: Options
ar: الخيارات

source: Allow Multiple Selections
ar: السماح باختيارات متعددة

source: Randomize Options
ar: ترتيب عشوائي للخيارات

source: Minimum Options Required
ar: الحد الأدنى للخيارات المطلوبة

source: The Options field is required for a multiple choice question.
ar: حقل الخيارات مطلوب لسؤال الاختيار من متعدد.

source: At least two options are required for a multiple choice question.
ar: مطلوب خيارين على الأقل لسؤال الاختيار من متعدد.

source: The minimum number of required options cannot be greater than the total number of available options.
ar: لا يمكن أن يكون الحد الأدنى للخيارات المطلوبة أكبر من إجمالي عدد الخيارات المتاحة.

source: The minimum number of required options cannot be negative.
ar: لا يمكن أن يكون الحد الأدنى للخيارات المطلوبة رقمًا سالبًا.

source: The Options field is required for a Likert question.
ar: حقل الخيارات مطلوب لسؤال ليكرت.

source: At least two options are required for a Likert question.
ar: مطلوب خيارين على الأقل لسؤال ليكرت.

source: The Rows fields are required for a Matrix question.
ar: حقول الصفوف مطلوبة لسؤال المصفوفة.

source: At least two rows are required for a Matrix question.
ar: مطلوب صفين على الأقل لسؤال المصفوفة.

source: The Columns fields are required for a Matrix question.
ar: حقول الأعمدة مطلوبة لسؤال المصفوفة.

source: At least two columns are required for a Matrix question.
ar: مطلوب عمودين على الأقل لسؤال المصفوفة.

source: e.g. Poor
ar: مثال: ضعيف

source: e.g. Excellent
ar: مثال: ممتاز

source: Range Minimum
ar: الحد الأدنى للنطاق

source: Range Maximum
ar: الحد الأقصى للنطاق

source: Minimum Label
ar: تسمية الحد الأدنى

source: Maximum Label
ar: تسمية الحد الأقصى

source: Max value must be greater than Min value.
ar: يجب أن تكون القيمة العظمى أكبر من القيمة الصغرى.

source: Scale range is too large (max 20 steps).
ar: نطاق المقياس كبير جدًا (الحد الأقصى 20 خطوة).

source: Draft
ar: مسودة

source: Published
ar: منشور

source: Archived
ar: مؤرشف

source: Created At
ar: تاريخ الإنشاء

source: Last Updated
ar: آخر تحديث

source: State
ar: الحالة

source: Created By
ar: تم الإنشاء بواسطة

source: Question Count
ar: عدد الأسئلة

source: Survey
ar: الاستبيان

source: Surveys
ar: الاستبيانات

source: Position
ar: الموضع

source: Question
ar: سؤال

source: Questions
ar: الأسئلة

source: Allow Multiple
ar: السماح بمتعدد

source: Show as Dropdown
ar: عرض كقائمة منسدلة

source: Show as Rank Question
ar: عرض كسؤال ترتيب

source: Minimum Options to Select
ar: الحد الأدنى للخيارات للتحديد

source: Multi-Choice Question
ar: سؤال اختيار من متعدد

source: Scale Max
ar: الحد الأقصى للمقياس

source: Likert Question
ar: سؤال ليكرت

source: Rows
ar: الصفوف

source: Columns
ar: الأعمدة

source: Matrix Question
ar: سؤال مصفوفة

source: Is Long Answer
ar: إجابة طويلة

source: Minimum Length
ar: الحد الأدنى للطول

source: Maximum Length
ar: الحد الأقصى للطول

source: Text Question
ar: سؤال نصي

source: Section Header
ar: رأس القسم

source: Range Min
ar: الحد الأدنى للنطاق

source: Range Max
ar: الحد الأقصى للنطاق

source: Min Label
ar: تسمية الحد الأدنى

source: Max Label
ar: تسمية الحد الأقصى

source: Rating Question
ar: سؤال تقييم

source: Ranking Question
ar: سؤال ترتيب

source: Recent Activity
ar: النشاط الأخير

source: Surveys with recent responses
ar: الاستبيانات ذات الردود الحديثة

source: No surveys yet
ar: لا توجد استبيانات بعد

source: Create your first survey to see it here.
ar: قم بإنشاء استبيانك الأول لتراه هنا.

source: All Surveys
ar: كل الاستبيانات

source: Survey Responses
ar: ردود الاستبيان

source: Overview of recent activity and all collected responses across your surveys.
ar: نظرة عامة على النشاط الأخير وجميع الردود التي تم جمعها عبر استبياناتك.

source: No responses yet
ar: لا توجد ردود بعد

source: Surveys with new responses will appear here.
ar: ستظهر الاستبيانات ذات الردود الجديدة هنا.

source: No description provided.
ar: لم يتم تقديم وصف.

source: Copy survey link
ar: نسخ رابط الاستبيان

source: Copy Link
ar: نسخ الرابط

source: Copied!
ar: تم النسخ!

source: Show Responses
ar: عرض الردود

source: Preview
ar: معاينة

source: Edit
ar: تعديل

source: Copy
ar: نسخ

source: End Survey
ar: إنهاء الاستبيان

source: Restore
ar: استعادة

source: Begin Survey
ar: بدء الاستبيان

source: Delete
ar: حذف

source: Status
ar: الحالة

source: Responses
ar: الردود

source: Language
ar: اللغة

source: Actions
ar: إجراءات

source: Get started by creating your first survey.
ar: ابدأ بإنشاء استبيانك الأول.

source: Create New Survey
ar: إنشاء استبيان جديد

source: Active
ar: نشط

source: No description available
ar: لا يوجد وصف متاح

source: Total Responses
ar: إجمالي الردود

source: View
ar: عرض

source: My Survey
ar: استبياناتي

source: Create Survey
ar: إنشاء استبيان

source: Publish
ar: نشر

source: Logout
ar: تسجيل الخروج

source: Login
ar: تسجيل الدخول

source: Sign Up
ar: إنشاء حساب

source: Search surveys...
ar: ابحث في الاستبيانات...

source: All States
ar: كل الحالات

source: All Responses
ar: كل الردود

source: Has Responses
ar: لديه ردود

source: No Responses
ar: لا يوجد ردود

source: Showing
ar: عرض

source: of
ar: من

source: surveys
ar: الاستبيانات

source: Last Updated
ar: آخر تحديث منذ

source: Start Survey
ar: بدء الاستبيان

source: Unpublish Survey?
ar: إلغاء نشر الاستبيان؟

source: Publish Survey?
ar: نشر الاستبيان؟

source: Restore Survey?
ar: استعادة الاستبيان؟

source: Are you sure you want to change the status of
ar: هل أنت متأكد أنك تريد تغيير حالة

source: from
ar: من

source: to
ar: إلى

source: Warning:
ar: تحذير:

source: Unpublishing will prevent users from accessing this survey immediately.
ar: سيؤدي إلغاء النشر إلى منع المستخدمين من الوصول إلى هذا الاستبيان على الفور.

source: Restoring Archived Survey:
ar: استعادة الاستبيان المؤرشف:

source: Restoring will not automatically publish the survey. You will need to publish it separately.
ar: لن يؤدي الاستعادة إلى نشر الاستبيان تلقائيًا. ستحتاج إلى نشره بشكل منفصل.

source: Note:
ar: ملاحظة:

source: Publishing will make this survey accessible to users.
ar: سيجعل النشر هذا الاستبيان متاحًا للمستخدمين.

source: Cancel
ar: إلغاء

source: Confirm
ar: تأكيد

source: Close
ar: إغلاق

source: Settings
ar: الإعدادات

source: Save Draft
ar: حفظ المسودة

source: Question Library
ar: مكتبة الأسئلة

source: Drag and drop to add questions
ar: اسحب وأفلت لإضافة أسئلة

source: Drag Question Here To Start
ar: اسحب السؤال هنا للبدء

source: Add New Question
ar: إضافة سؤال جديد

source: Drag a question type from the library or click below to add one manually.
ar: اسحب نوع سؤال من المكتبة أو انقر أدناه لإضافة واحد يدويًا.

source: Tap the button below to select a question type.
ar: انقر على الزر أدناه لتحديد نوع السؤال.

source: Add Question
ar: إضافة سؤال

source: Select a format to add to your survey
ar: حدد تنسيقًا لإضافته إلى استبيانك

source: Select one or more options from a predefined list.
ar: حدد خيارًا واحدًا أو أكثر من قائمة محددة مسبقًا.

source: Measure agreement or feelings on a detailed scale.
ar: قياس الاتفاق أو المشاعر على مقياس مفصل.

source: Evaluate multiple items using the same set of column choices.
ar: تقييم عناصر متعددة باستخدام نفس مجموعة خيارات الأعمدة.

source: Rate items using stars, numbers, or other icons.
ar: تقييم العناصر باستخدام النجوم أو الأرقام أو أيقونات أخرى.

source: Rank items in order of preference.
ar: ترتيب العناصر حسب التفضيل.

source: Allow respondents to enter open-ended text answers.
ar: السماح للمستجيبين بإدخال إجابات نصية مفتوحة النهاية.

source: Add a header to organize your survey logic or sections.
ar: إضافة رأس لتنظيم منطق الاستبيان أو الأقسام الخاصة بك.

source: Add this specific question type to your survey layout.
ar: أضف هذا النوع المحدد من الأسئلة إلى تخطيط الاستبيان الخاص بك.

source: Help text
ar: نص المساعدة

source: Optional
ar: اختياري

source: Scale Options
ar: خيارات المقياس

source: Load 1-5 Scale
ar: تحميل مقياس من 1-5

source: No scale options added.
ar: لم تتم إضافة خيارات مقياس.

source: Click
ar: انقر

source: or add manually.
ar: أو أضف يدويًا.

source: Type a scale option (e.g. Agree) and press Enter...
ar: اكتب خيار مقياس (مثل موافق) واضغط على Enter...

source: warning
ar: تحذير

source: Analysis Tip: Even number of options
ar: نصيحة تحليل: عدد زوجي من الخيارات

source: Likert scales usually use an
ar: عادةً ما تستخدم مقاييس ليكرت

source: odd number
ar: عدد فردي

source: to include a neutral midpoint.
ar: لتضمين نقطة وسط محايدة.

source: Even numbers force the user to pick a positive or negative side.
ar: الأعداد الزوجية تجبر المستخدم على اختيار جانب إيجابي أو سلبي.

source: core relation
ar: العلاقة الأساسية

source: Multiple answers
ar: إجابات متعددة

source: Randomize
ar: ترتيب عشوائي

source: Min. Selections
ar: الحد الأدنى للتحديدات

source: Answer Options
ar: خيارات الإجابة

source: No options added yet.
ar: لم تتم إضافة خيارات بعد.

source: Add choices like "Yes", "No", or "Maybe".
ar: أضف خيارات مثل "نعم"، "لا"، أو "ربما".

source: Type an option and press Enter...
ar: اكتب خيارًا واضغط على Enter...

source: Analysis Tip: Large number of options
ar: نصيحة تحليل: عدد كبير من الخيارات

source: Presenting too many choices (>8) can lead to
ar: عرض العديد من الخيارات (>8) يمكن أن يؤدي إلى

source: decision fatigue
ar: إرهاق القرار

source: causing respondents to skip the question or pick the first option. Consider grouping options or using Other field.
ar: مما يجعل المستجيبين يتخطون السؤال أو يختارون الخيار الأول. فكر في تجميع الخيارات أو استخدام حقل آخر.

source: Matrix / Likert Scale
ar: مصفوفة / مقياس ليكرت

source: Row Items
ar: عناصر الصف

source: No rows added yet.
ar: لم تتم إضافة صفوف بعد.

source: Add questions like "Staff Service"
ar: أضف أسئلة مثل "خدمة الموظفين"

source: Type row question...
ar: اكتب سؤال الصف...

source: Scale
ar: المقياس

source: Type scale option (e.g. Agree)...
ar: اكتب خيار المقياس (مثل موافق)...

source: Question Settings
ar: إعدادات السؤال

source: Long Answer (Paragraph)
ar: إجابة طويلة (فقرة)

source: Min Length
ar: الحد الأدنى للطول

source: Max Length
ar: الحد الأقصى للطول

source: Section
ar: قسم

source: Creates a new page title (no answer collected)
ar: ينشئ عنوان صفحة جديد (لا يتم جمع إجابة)

source: Page Break
ar: فاصل صفحة

source: Section Title
ar: عنوان القسم

source: Subtitle (optional)
ar: العنوان الفرعي (اختياري)

source: Optional subtitle
ar: عنوان فرعي اختياري

source: Items to Rank
ar: عناصر للترتيب

source: Clear All
ar: مسح الكل

source: Add items for the user to rank.
ar: أضف عناصر ليقوم المستخدم بترتيبها.

source: Type an item (e.g. 'Price') and press Enter...
ar: اكتب عنصرًا (مثل 'السعر') واضغط على Enter...

source: You need at least two options to rank.
ar: تحتاج إلى خيارين على الأقل للترتيب.

source: Excellent
ar: ممتاز

source: Poor
ar: ضعيف

source: Rating Scale Setup
ar: إعداد مقياس التقييم

source: Range Values
ar: قيم النطاق

source: Labels (Optional)
ar: التسميات (اختياري)

source: Min:
ar: الحد الأدنى:

source: Max:
ar: الحد الأقصى:

source: Go Back
ar: العودة

source: Survey Preview
ar: معاينة الاستبيان

source: Preview Mode: Responses will not be saved.
ar: وضع المعاينة: لن يتم حفظ الردود.

source: Powered by
ar: مدعوم من قبل

source: Q
ar: س

source: Please select at least
ar: يرجى تحديد ما لا يقل عن

source: options.
ar: خيارات.

source: Incomplete Section
ar: قسم غير مكتمل

source: Please answer all required questions marked with a red dot
ar: يرجى الإجابة على جميع الأسئلة المطلوبة المشار إليها بنقطة حمراء

source: to proceed.
ar: للمتابعة.

source: Previous
ar: السابق

source: Next Section
ar: القسم التالي

source: Submit Survey
ar: إرسال الاستبيان

source: Delete Survey
ar: حذف الاستبيان

source: Are you sure you want to delete
ar: هل أنت متأكد أنك تريد حذف

source: This action cannot be undone.
ar: لا يمكن التراجع عن هذا الإجراء.

source: Warning: This survey is Published!
ar: تحذير: هذا الاستبيان منشور!

source: Deleting it will prevent users from accessing it immediately.
ar: سيؤدي حذفه إلى منع المستخدمين من الوصول إليه على الفور.

source: Existing responses will also be permanently deleted.
ar: سيتم أيضًا حذف الردود الموجودة بشكل دائم.

source: Yes, Delete it
ar: نعم، احذفه

source: Back to Responses
ar: العودة إلى الردود

source: View Data Grid
ar: عرض شبكة البيانات

source: Preview & Export
ar: معاينة وتصدير

source: Analytics & Reports
ar: التحليلات والتقارير

source: Individual Responses
ar: الردود الفردية

source: Responses Overview
ar: نظرة عامة على الردود

source: Detailed list of all submitted responses
ar: قائمة مفصلة بجميع الردود المقدمة

source: Respondent
ar: المستجيب

source: Submitted At
ar: تم الإرسال في

source: Member
ar: عضو

source: Anonymous
ar: مجهول

source: Guest
ar: زائر

source: Completed
ar: مكتمل

source: Incomplete
ar: غير مكتمل

source: View Details
ar: عرض التفاصيل

source: Response Details
ar: تفاصيل الرد

source: by
ar: بواسطة

source: Skipped / No answer provided
ar: تم التخطي / لم يتم تقديم إجابة

source: Once people start taking your survey, their responses will appear here.
ar: بمجرد أن يبدأ الأشخاص في إجراء الاستبيان الخاص بك، ستظهر ردودهم هنا.

source: Matrix view of all given answers
ar: عرض مصفوفة لجميع الإجابات المقدمة

source: Page
ar: صفحة

source: Got it
ar: فهمت

source: Back to Details
ar: العودة إلى التفاصيل

source: Data Grid
ar: شبكة البيانات

source: View and export all responses in tabular format.
ar: عرض وتصدير جميع الردود في شكل جدولي.

source: By Section
ar: بالقسم

source: Raw Data
ar: البيانات الخام

source: Numeric Data
ar: البيانات الرقمية

source: Download CSV
ar: تنزيل CSV

source: No responses found for this section.
ar: لم يتم العثور على ردود لهذا القسم.

source: No responses found.
ar: لم يتم العثور على ردود.

source: Show All Sections
ar: عرض جميع الأقسام

source: Export Report
ar: تصدير تقرير

source: Completion Rate
ar: معدل الإكمال

source: Last Response
ar: آخر رد

source: Current Section
ar: القسم الحالي

source: Analystics not available for this question type
ar: التحليلات غير متوفرة لهذا النوع من الأسئلة

source: Include in correlation analysis
ar: تضمين في تحليل الارتباط

source: Mean
ar: المتوسط

source: Median
ar: الوسيط

source: Interp.
ar: التفسير

source: T-Test
ar: اختبار - T

source: Rating Distribution
ar: توزيع التقييم

source: Visualization
ar: التصوير البياني

source: Percentage of Question Respondents
ar: نسبة المستجيبين للسؤال

source: Detailed Breakdown
ar: تفصيل مفصل

source: Row Item
ar: عنصر الصف

source: Average Score
ar: متوسط النقاط

source: Median Score
ar: النقاط الوسيطة

source: Standard Interpretation
ar: التفسير القياسي

source: T-Test Value
ar: قيمة اختبار - T

source: Response Statistics
ar: إحصائيات الردود

source: Option
ar: خيار

source: Count
ar: عدد

source: Distribution
ar: التوزيع

source: No data available to display
ar: لا توجد بيانات متاحة للعرض

source: Rating Frequency
ar: تكرار التقييم

source: stars
ar: نجوم

source: A higher average score indicates a better ranking position (closer to 1st place).
ar: يشير متوسط النقاط الأعلى إلى موقع ترتيب أفضل (أقرب إلى المركز الأول).

source: Performance Leaderboard
ar: لوحة المتصدرين للأداء

source: Average
ar: المتوسط

source: Top Ranked
ar: الأعلى ترتيبًا

source: Feature Correlation Analysis
ar: تحليل ارتباط الميزات

source: Visualizing relationships between question responses
ar: تصوير العلاقات بين ردود الأسئلة

source: Generate Correlation
ar: توليد الارتباط

source: Build Your Correlation Matrix
ar: بناء مصفوفة الارتباط الخاصة بك

source: Select "Compare" on at least 2 questions above, then click the button below to visualize their statistical relationship.
ar: حدد "مقارنة" على سؤالين على الأقل أعلاه، ثم انقر على الزر أدناه لتصور العلاقة الإحصائية بينهما.

source: Requires sufficient numerical data in responses
ar: يتطلب بيانات رقمية كافية في الردود

source: Thank You!
ar: شكراً لك!

source: Your response to
ar: ردك على

source: has been successfully recorded.
ar: تم تسجيله بنجاح.

source: We appreciate your time and effort in sharing your feedback with us.
ar: نحن نقدر وقتك وجهدك في مشاركة ملاحظاتك معنا.

source: Move Up
ar: التحرك للأعلى

source: Move Down
ar: التحرك للأسفل

source: Delete Option
ar: حذف الخيار

source: Please rank all remaining options.
ar: يرجى ترتيب جميع الخيارات المتبقية.

source: Your Ranking
ar: ترتيبك

source: item(s) ranked
ar: عنصر/عناصر تم ترتيبها

source: Tap options below to add them here in order
ar: انقر على الخيارات أدناه لإضافتها هنا بالترتيب

source: Available Options
ar: الخيارات المتاحة

source: Create Account
ar: إنشاء حساب

source: Join to participate in surveys
ar: انضم للمشاركة في الاستطلاعات

source: Start creating your own surveys today
ar: ابدأ في إنشاء استبياناتك الخاصة اليوم

source: Already have an account?
ar: هل لديك حساب بالفعل؟

source: Sign up with Google
ar: التسجيل باستخدام جوجل

source: Welcome Back
ar: مرحبًا بعودتك

source: Login to continue to the survey
ar: تسجيل الدخول للمتابعة إلى الاستبيان

source: Manage your surveys and responses
ar: إدارة استبياناتك وردودك

source: Forgot password?
ar: هل نسيت كلمة المرور؟

source: Continue with Google
ar: المتابعة باستخدام جوجل

source: Don't have an account?
ar: ليس لديك حساب؟

source: Create New Surveyor Account
ar: إنشاء حساب جديد
